/*************************************************************************
    > File Name: p047-数组-二维数组定义方式.cpp
    > 作者: 品赫先生
    > Mail: huangpinhe65@gmail.com 
    > Created Time: 2024年09月02日 星期一 11时08分02秒

	数据类型 数组名[行数][列数];
	数据类型 数组名[行数][列数]={{数据1,数据2},{数据3,数据4},...};//最为直观，可读性最好
	数据类型 数组名[行数][列数]={数据1,数据2,数据3,数据4,...};
	数据类型 数组名[    ][列数]={数据1,数据2,数据3,数据4,...};
 ************************************************************************/
#include<iostream>
#include<algorithm>
using namespace std;

void test(){
	//数据类型 数组名[行数][列数]={{数据1,数据2},{数据3,数据4},...};//最为直观，可读性最好
	int array[][6]={1,2,3,4,5,6,7,8,9,10,11,12,13,14};
	int x=sizeof(array)/sizeof(array[0][0]);
	int num=x/6;
	cout<<"数组元素总个数="<<x<<endl;
	cout<<"数组行数======="<<num<<endl;
	cout<<"数组列数======="<<x/num<<endl;
	//遍历二维数组
	for(int i=0;i<num;i++){
		for(int j=0;j<x/num;j++){
			cout<<array[i][j]<<"  ";
		}
		cout<<endl;
	}
}

int main(){
	test();
	return 0;
}
