#include <stdio.h>
#include <time.h>
#include <stdlib.h>

int main()
{
    // srand() 获取种子
    //  rand() 随机数

    // 1.设置种子
    // 初始值
    // 初始值不变，随机数也是不变的
    // 所以需要一个不断变化的初始值

    srand(time(NULL));

    // 2.获取随机数
    // 随机数的范围0-32767
    // 任意范围随机数
    // 1-100
    // 7-23
    // 8=49
    // 用于产生任意范围之内的随机数
    // 把这个范围变成包头不包尾 包左不包右的
    // 如产生随机数范围 7-23 包头不包尾 7-24
    // 拿着尾数减去头数 24-7 = 17
    // 修改代码 rand() % 17 + 7
    for (int i = 1; i <= 10; i++)
    {
        int num = rand() % 17 + 7;
        printf("%d\n", num);
    }
    return 0;
}